app/controllers/auth_controller.rb

  def verifyLogin
    @user = User.new(user_params)
    user = User.find_by(email: @user.email)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'trinket@hotmail.ca' LIMIT 1