app/controllers/battle_controller.rb

SELECT `characters`.* FROM `characters` WHERE `characters`.`id` = 2 LIMIT 1
SELECT `classes`.* FROM `classes` WHERE `classes`.`id` = 8 LIMIT 1
SELECT `classes_spells`.* FROM `classes_spells` WHERE `classes_spells`.`id_class` = 8
SELECT `character_quests`.* FROM `character_quests` WHERE `character_quests`.`id_character` = 2
SELECT `quests`.* FROM `quests` WHERE `quests`.`id` = 1
SELECT `steps`.* FROM `steps` WHERE `steps`.`id_quest` = 1 AND `steps`.`number` = 1
SELECT `pnj_steps`.* FROM `pnj_steps` WHERE `pnj_steps`.`id_step` = 1
SELECT `pnjs`.* FROM `pnjs` WHERE `pnjs`.`id` = 2 LIMIT 1
---
  def index


    # Bagarre!!!!!
  # end

    # Affichage du personnage actuel
    @Character = Character.find(2)
    @Characterhp = @Character.hp + @Character.str*50
    @CharacterMana = @Character.intel*50
    @CharacterAttack = 10 + @Character.str*5
    @CharacterArmor = @Character.agi*5

    # Affichage de la classe du personnage
    @CharacterClass = Classes.find(@Character.id_class)
    @CharacterClassname= @CharacterClass.name

    # Affichage des sorts du personnage
    @IdSpells = ClassesSpells.where(:id_class => @CharacterClass.id)
    @CharacterSpells = Spells.where(:id => @IdSpells.map { |x| x.id_spell })

    # Affichage de l'adversaire
    @IdQuest = CharacterQuest.where(:id_character => @Character.id)
    puts YAML::dump(@IdQuest)
    @Quest = Quest.where(:id => @IdQuest.map { |x| x.id_quest})
    @Step = Step.where(:id_quest => @Quest.map { |x| x.id }, :number => @IdQuest.map{ |x| x.advancement})
    @IdPnj = PnjStep.where(:id_step => @Step.map { |x| x.id })
    @Pnj = Pnj.find(@IdPnj.map { |x| x.id_pnj })
    @Pnj = @Pnj.first()