app/controllers/fichestats_controller.rb

SELECT `characters`.* FROM `characters` WHERE `characters`.`id` = 2 LIMIT 1
SELECT `classes`.* FROM `classes` WHERE `classes`.`id` = 2 LIMIT 1
SELECT `classes_spells`.* FROM `classes_spells` WHERE `classes_spells`.`id_class` = 8
SELECT `spells`.* FROM `spells` WHERE `spells`.`id` IN (15, 16)
SELECT `classes_spells`.* FROM `classes_spells` WHERE `classes_spells`.`id_class` = 2
SELECT `inventories`.* FROM `inventories` WHERE `inventories`.`id` = NULL LIMIT 1
SELECT `inventory_items`.* FROM `inventory_items` WHERE `inventory_items`.`id_inventory` = 1
SELECT `items`.* FROM `items` WHERE `items`.`id` = 3
SELECT `stuffs`.* FROM `stuffs` WHERE `stuffs`.`id_inventory` = 1
---
  def index


    # LESSTAAATTS
  # end

    # Affichage du personnage actuel
    @Character = Character.find(1)
    @Characterhp = @Character.hp + @Character.str*50
    @CharacterMana = @Character.intel*50
    @CharacterAttack = 10 + @Character.str*5
    @CharacterArmor = @Character.agi*5

    # Affichage de la classe du personnage
    @CharacterClass = Classes.find(@Character.id_class)
    @CharacterClassname= @CharacterClass.name

    # Affichage des sorts du personnage
    @IdSpells = ClassesSpells.where(:id_class => @CharacterClass.id)
    @CharacterSpells = Spells.where(:id => @IdSpells.map { |x| x.id_spell })

    # Affichage de l'inventaire du personnage
    @CharacterInventory = Inventory.find(@Character.id)
    @IdItems = InventoryItem.where(:id_inventory => @CharacterInventory.id)
    @CharacterItems = Item.where(:id => @IdItems.map { |x| x.id_item })

    #Affichage de l'équipement du personnage
    @CharacterStuff = Stuff.where(:id_inventory => @CharacterInventory.id)