app/controllers/home_controller.rb

  def logged
    if session[:user_id]
      @user = User.find(session[:user_id])
      if @user.nil?
        redirect_to auth_login_path, alert: "You must be logged in to access this section"
      end

      @characters = @user.characters.includes(:classes)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `classes`.* FROM `classes` WHERE `classes`.`id` IN (2, 8)