app/controllers/playing_controller.rb

  def verifyLoggedCharacter
    @character = Character.find_by(id: params[:id])
---
SELECT `characters`.* FROM `characters` WHERE `characters`.`id` = 2 LIMIT 1

  def enterWorld
    @character = Character.find_by(id: session[:character_id])
    quest = Quest.find_by(id: 1)
    character_quest = CharacterQuest.find_by(id_character: @character.id, id_quest: quest.id)

    if character_quest.nil?
      @quest_available = true
      @pnj = nil
    else
      @pnj = Pnj.find_by(id: 2)
---
SELECT `characters`.* FROM `characters` WHERE `characters`.`id` = 2 LIMIT 1
SELECT `quests`.* FROM `quests` WHERE `quests`.`id` = 1 LIMIT 1
SELECT `character_quests`.* FROM `character_quests` WHERE `character_quests`.`id_character` = 2 AND `character_quests`.`id_quest` = 1 LIMIT 1
SELECT `pnjs`.* FROM `pnjs` WHERE `pnjs`.`id` = 2 LIMIT 1